r"""
(c) 2023 by rice0208, licensed under MIT.

# 判断四位回文数

## 题目描述

给定一个正整数 $n$，判断其是否为四位的回文数。**回文数**是指：从左往右读，和从右往左读 是一样的。        
        
例如：$2$、$5$、$33$、$101$、$383$、$1221$、$6666$ 都是回文数     

请写一个程序，判断 $n$ 是否为$\color{Red}\textbf{四位}$的回文数。

## 输入格式

一个正整数 $n$，  $1<=n<=100000$

## 输出格式

Yes 或 No

## 样例 #1

### 样例输入 #1

```
6666
```

### 样例输出 #1

```
Yes
```

## 样例 #2

### 样例输入 #2

```
1234
```

### 样例输出 #2

```
No
```

## 样例 #3

### 样例输入 #3

```
121
```

### 样例输出 #3

```
No
```

## 提示

不要忘记四位正整数的范围
"""

n = int(input())

if 1000 <= n <= 9999 and n % 11 == 0:
    d = n % 10
    r = n // 11 - 91 * d
    if r % 10 == 0 and 0 <= r <= 90:
        print("Yes")
    else:
        print("No")
else:
    print("No")
