r"""
(c) 2023 by rice0208, licensed under MIT.

# Beautiful Year

## 题目描述

给定一个年份 $n(1000<=n<=9000)$，输出大于$n$的第一个四位数字都不相同的年份。

## 输入格式

## 输出格式

## 样例 #1

### 样例输入 #1

```
1987
```

### 样例输出 #1

```
2013
```

## 样例 #2

### 样例输入 #2

```
2013
```

### 样例输出 #2

```
2014
```

## 样例 #3

### 样例输入 #3

```
1111
```

### 样例输出 #3

```
1203
```
"""

n = int(input())

while True:
    n += 1
    a = n // 1000
    b = (n % 1000) // 100
    c = (n % 100) // 10
    d = n % 10

    if a != b and a != c and a != d:
        if b != c and b != d:
            if c != d:
                break

print(n)
