r"""
(c) 2023 by rice0208, licensed under MIT.

# 数字反转

## 题目描述

给定一个整数，请将该数各个位上数字反转得到一个新数。新数也应满足整数的常见形式，即除非给定的原数为零，否则反转后得到的新数的最高位数字不应为零（参见样例2）。

## 输入格式

一个整数 $N$

## 输出格式

一个整数，表示反转后的新数。

## 样例 #1

### 样例输入 #1

```
0
```

### 样例输出 #1

```
0
```

## 样例 #2

### 样例输入 #2

```
123
```

### 样例输出 #2

```
321
```

## 样例 #3

### 样例输入 #3

```
1203000
```

### 样例输出 #3

```
3021
```

## 样例 #4

### 样例输入 #4

```
-380
```

### 样例输出 #4

```
-83
```

## 提示

小心0这个数据，防止超时死机......
"""

n = int(input())

if n < 0:
    print("-", end="")
    n *= -1

while n % 10 == 0 and n != 0:
    n = n // 10

n = str(n)

for i in range(1, len(n) + 1):
    print(n[len(n) - i], end="")
