r"""
(c) 2023 by rice0208, licensed under MIT.

# 最大公因数

## 题目描述

给定两个非负整数 $a$ 和 $b$ ，求它们的最大公因数。            
$0<=a, b<=1,000,000,000$      
$a$ 和 $b$ 不会同时为0

## 输入格式

一行，两个整数，中间以空格分隔，表示 $a$ 和 $b$ 。

## 输出格式

一个整数，表示 $a$ 和 $b$ 的最大公因数。

## 样例 #1

### 样例输入 #1

```
0  3
```

### 样例输出 #1

```
3
```

## 样例 #2

### 样例输入 #2

```
3  0
```

### 样例输出 #2

```
3
```

## 样例 #3

### 样例输入 #3

```
18  24
```

### 样例输出 #3

```
6
```

## 样例 #4

### 样例输入 #4

```
999999999  999999998
```

### 样例输出 #4

```
1
```

## 提示

**【Python语言横向输入的方法】**      
s=input().split()    
a=int(s[0])    
b=int(s[1])
"""

ab = input().split()

a = int(ab[0])
b = int(ab[1])

while True:
    if b == 0:
        break
    a %= b
    if a == 0:
        break
    b %= a

print(a + b)
